---
kind: type
id: T:Autodesk.Revit.DB.ElementNode
source: html/45f8a303-c479-9d6e-c39e-7705169820c2.htm
---
# Autodesk.Revit.DB.ElementNode

A render node that represents an element, including the host document containing the element.

## Syntax (C#)
```csharp
public class ElementNode : RenderNode
```

## Remarks
See also: OnElementBegin2D(ElementNode) .
 See also: OnElementEnd2D(ElementNode) .